{"class_name": "Sequential", "config": {"name": "sequential_95", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 56], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_3_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, 56], "dtype": "float32", "input_dim": 2072, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 56}}, {"class_name": "Dropout", "config": {"name": "dropout_336", "trainable": true, "batch_input_shape": [null, 56, 50], "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Functional", "config": {"name": "model_93", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 56, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_94"}, "name": "input_94", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_196", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_196", "inbound_nodes": [[["input_94", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_197", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_197", "inbound_nodes": [[["input_94", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_198", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_198", "inbound_nodes": [[["input_94", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_196", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_196", "inbound_nodes": [[["conv1d_196", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_197", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_197", "inbound_nodes": [[["conv1d_197", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_198", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_198", "inbound_nodes": [[["conv1d_198", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_198", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_198", "inbound_nodes": [[["max_pooling1d_196", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_199", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_199", "inbound_nodes": [[["max_pooling1d_197", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_200", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_200", "inbound_nodes": [[["max_pooling1d_198", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_93", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_93", "inbound_nodes": [[["flatten_198", 0, 0, {}], ["flatten_199", 0, 0, {}], ["flatten_200", 0, 0, {}]]]}], "input_layers": [["input_94", 0, 0]], "output_layers": [["concatenate_93", 0, 0]]}}, {"class_name": "Dense", "config": {"name": "dense_338", "trainable": true, "dtype": "float32", "units": 150, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_337", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Activation", "config": {"name": "activation_336", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_339", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_337", "trainable": true, "dtype": "float32", "activation": "sigmoid"}}]}, "keras_version": "2.4.0", "backend": "tensorflow"}