{"class_name": "Sequential", "config": {"name": "sequential_169", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 56], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_2_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 56], "dtype": "float32", "input_dim": 2072, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 56}}, {"class_name": "Dropout", "config": {"name": "dropout_604", "trainable": true, "batch_input_shape": [null, 56, 50], "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Functional", "config": {"name": "model_167", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 56, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_168"}, "name": "input_168", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_415", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_415", "inbound_nodes": [[["input_168", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_416", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_416", "inbound_nodes": [[["input_168", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_415", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_415", "inbound_nodes": [[["conv1d_415", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_416", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_416", "inbound_nodes": [[["conv1d_416", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_417", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_417", "inbound_nodes": [[["max_pooling1d_415", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_418", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_418", "inbound_nodes": [[["max_pooling1d_416", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_167", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_167", "inbound_nodes": [[["flatten_417", 0, 0, {}], ["flatten_418", 0, 0, {}]]]}], "input_layers": [["input_168", 0, 0]], "output_layers": [["concatenate_167", 0, 0]]}}, {"class_name": "Dense", "config": {"name": "dense_606", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_605", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Activation", "config": {"name": "activation_604", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_607", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_606", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Activation", "config": {"name": "activation_605", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_608", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_606", "trainable": true, "dtype": "float32", "activation": "sigmoid"}}]}, "keras_version": "2.4.0", "backend": "tensorflow"}